# Основи роботи з Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
print(pd.__version__)

1.0.3

# Titanic

In [197]:
df = pd.read_csv('titanic-passengers.csv', sep=";", index_col='PassengerId')

In [198]:
df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
343,No,2,"Collander, Mr. Erik Gustaf",male,28.0,0,0,248740,13.0000,NaN,S
76,No,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.6500,F G73,S
641,No,3,"Jensen, Mr. Hans Peder",male,20.0,0,0,350050,7.8542,NaN,S
568,No,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.0750,NaN,S
672,No,1,"Davidson, Mr. Thornton",male,31.0,1,0,F.C. 12750,52.0000,B71,S

1. Яка кількість чоловіків і жінок їхала на кораблі? Приведіть два числа через пробіл.

In [199]:
male_num = df[(df["Sex"] == "male")].shape[0]
female_num = df[(df["Sex"] == "female")].shape[0]
print(f"кількість male_num: {int(female_num)}; кількість чоловіків:{int(male_num)}")

кількість male_num: 314; кількість чоловіків:577

2. Якій частині пасажирів вдалося вижити? Порахуйте частку пасажирів, що вижили.<br>
Відповідь приведіть у відсотках (число в інтервалі від 0 до 100, знак відсотка не
потрібний), округливши до двох знаків.

In [200]:
all_passengers = df['Survived'].count()
survived_passengers = df[(df["Survived"] == "Yes")].shape[0]

print(f"{int(round(survived_passengers/all_passengers, 2) * 100)}%")

38%

3. Яку частку пасажири першого класу складали серед всіх пасажирів?<br>
Відповідь приведіть у відсотках (число в інтервалі від 0 до 100, знак відсотка не потрібний), округливши до двох знаків.

In [201]:
p_class_all = df['Pclass'].count()
p_class_one = df[(df["Pclass"] == 1)].shape[0]

print(f"{int(round(p_class_one/p_class_all, 2) * 100)}%")

24%

4. Якого віку були пасажири? Порахуйте середнє і медіану віку пасажирів.<br>
Як відповідь приведіть два числа через пробіл.

In [202]:
passengers_age = df['Age']
mean = passengers_age.mean()
median = passengers_age.median()

print(f"mean: {int(mean)}; median:{int(median)}")

mean: 29; median:28

5. Чи корелює число братів / сестер / подружжя з числом батьків / дітей?<br>
Порахуйте кореляцію Пірсона між ознаками SibSp і Parch.

In [203]:
SibSp = df['SibSp']
Parch = df['Parch']
corr = SibSp.corr(Parch, method='pearson')

print(f"Pairwise correlation: {round(corr, 3)}")

Pairwise correlation: 0.415

6. Яке найпопулярніше жіноче ім'я на кораблі? Вийміть з повного імені пасажира (колонка Name) його особисте ім'я (First Name).<br>
Спробуйте вручну розібрати кілька значень стовпця Name і виробити правило для вилучення імен, а також поділу їх на жіночі і чоловічі.

In [204]:
male_names = list(df[(df["Sex"] == "male")]["Name"])
female_names = list(df[(df["Sex"] == "female")]["Name"])

male_first_names = [m.split(',')[0] for m in male_names]
female_first_names = [m.split(',')[0] for m in female_names]

print(f"First Name Male: {male_first_names[:5]}")
print(f"First Name Female: {female_first_names[:5]}")

First Name Male: ['Collander', 'Moen', 'Jensen', 'Davidson', 'Gustafsson']
First Name Female: ['Palsson', 'Nakid', 'Louch', 'Haas', 'Herman']

# World University Rankings

In [288]:
df = pd.read_csv('cwurData.csv')
df.shape

(2200, 14)

In [289]:
df.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

1. У рейтингу залиште тільки дані за 2015 рік.

In [290]:
df_2015 = df[df['year'] == 2015]
df_2015.shape

(1000, 14)

2. Обчисліть максимальний, мінімальний і середній загальний бал світового рейтингу.

In [291]:
score = df_2015['score']

mean = score.mean()
min_ = score.min()
max_ = score.max()

print(f"максимальний:{max_}; мінімальний:{min_}; середній:{mean}")

максимальний:100.0; мінімальний:44.02; середній:46.86385

3. Для всіх згаданих країн виведіть кількість університетів, які увійшли до світового рейтингу.<br>
Висновок організуйте спаданням кількості університетів.

In [292]:
country = df_2015['country']
country.value_counts()

USA                     229
China                    83
Japan                    74
United Kingdom           65
Germany                  55
France                   49
Italy                    47
Spain                    40
South Korea              36
Canada                   33
Australia                27
Taiwan                   21
Brazil                   18
India                    16
Netherlands              13
Austria                  12
Sweden                   11
Turkey                   10
Belgium                  10
Poland                    9
Switzerland               9
Finland                   9
Iran                      8
Ireland                   8
Israel                    7
Portugal                  7
Greece                    7
Hungary                   6
New Zealand               6
Hong Kong                 6
Norway                    5
Denmark                   5
Russia                    5
South Africa              5
Czech Republic            5
Egypt                     4
Chile                     4
Saudi Arabia              4
Argentina                 3
Malaysia                  3
Thailand                  3
Mexico                    2
Slovenia                  2
Singapore                 2
Romania                   2
Colombia                  2
Uganda                    1
Cyprus                    1
Lithuania                 1
Uruguay                   1
Serbia                    1
Slovak Republic           1
Croatia                   1
United Arab Emirates      1
Puerto Rico               1
Lebanon                   1
Bulgaria                  1
Estonia                   1
Iceland                   1
Name: country, dtype: int64

4. Обчисліть для кожної країни величину що є сумою загальних балів його університетів.<br>
Висновок організуйте по спадаючій цієї величини.

In [293]:
res = {}

countries = df_2015.country.unique()
for c in countries:
    df_ = df_2015[df_2015['country'] == c]
    score_all = df_['score'].sum()
    res[c] = score_all
    
{k: v for k, v in sorted(res.items(), key=lambda item: item[1], reverse=True)}

{'USA': 11475.240000000002,
 'China': 3724.5800000000004,
 'Japan': 3423.6299999999997,
 'United Kingdom': 3120.3,
 'Germany': 2543.1400000000003,
 'France': 2258.1800000000003,
 'Italy': 2126.85,
 'Spain': 1793.8,
 'South Korea': 1651.6499999999999,
 'Canada': 1543.89,
 'Australia': 1236.93,
 'Taiwan': 944.03,
 'Brazil': 803.39,
 'India': 712.78,
 'Netherlands': 627.1,
 'Austria': 539.8500000000001,
 'Sweden': 523.0,
 'Belgium': 467.66,
 'Switzerland': 453.57,
 'Turkey': 443.34000000000003,
 'Finland': 409.04,
 'Poland': 399.07,
 'Ireland': 360.92999999999995,
 'Israel': 358.31,
 'Iran': 353.31,
 'Portugal': 314.67999999999995,
 'Greece': 313.07,
 'Hong Kong': 276.2,
 'New Zealand': 269.54999999999995,
 'Hungary': 266.47,
 'Denmark': 240.27,
 'Russia': 234.20999999999998,
 'Norway': 232.62,
 'South Africa': 230.49,
 'Czech Republic': 223.40000000000003,
 'Chile': 178.69,
 'Saudi Arabia': 177.17,
 'Egypt': 176.38,
 'Thailand': 134.76,
 'Malaysia': 134.12,
 'Argentina': 133.78,
 'Singapore': 102.72999999999999,
 'Mexico': 89.84,
 'Slovenia': 88.98,
 'Colombia': 88.49000000000001,
 'Romania': 88.08,
 'Iceland': 44.91,
 'Estonia': 44.68,
 'Croatia': 44.62,
 'Lebanon': 44.38,
 'Slovak Republic': 44.38,
 'Serbia': 44.33,
 'Lithuania': 44.25,
 'Bulgaria': 44.19,
 'Uruguay': 44.16,
 'Uganda': 44.16,
 'Cyprus': 44.1,
 'United Arab Emirates': 44.08,
 'Puerto Rico': 44.06}

5. Обчисліть кращий університет для кожної країни, висновок організуйте по цій величині.

In [313]:
res = {}

countries = df_2015.country.unique()
for c in countries:
    df_ = df_2015[df_2015['country'] == c]
    score_max_id = df_['score'].idxmax()
    name = list(df_2015.loc[[score_max_id]].institution)[0]
    score = list(df_2015.loc[[score_max_id]].score)[0]

    print(c, name, score)

USA Harvard University 100.0
United Kingdom University of Cambridge 96.81
Japan University of Tokyo 78.23
Switzerland Swiss Federal Institute of Technology in Zurich 66.93
Israel Hebrew University of Jerusalem 65.71
South Korea Seoul National University 64.82
Canada University of Toronto 60.04
France École Polytechnique 59.2
China Peking University 54.26
Taiwan National Taiwan University 54.23
Russia Lomonosov Moscow State University 54.19
Singapore National University of Singapore 53.44
Sweden Karolinska Institute 52.79
Denmark University of Copenhagen 52.51
Germany Ruprecht Karl University of Heidelberg 52.32
Belgium Katholieke Universiteit Leuven 52.03
Netherlands Erasmus University Rotterdam 51.78
Australia University of Sydney 51.61
Norway University of Oslo 50.81
Finland University of Helsinki 50.04
Italy Sapienza University of Rome 49.97
Spain University of Barcelona 49.79
Brazil University of São Paulo 49.31
South Africa University of the Witwatersrand 48.75
Hong Kong University of Hong Kong 48.15
Ireland Trinity College, Dublin 47.73
Austria University of Vienna 47.03
Portugal University of Lisbon 46.43
New Zealand University of Auckland 46.38
Czech Republic Charles University in Prague 46.32
Greece National and Kapodistrian University of Athens 45.94
Thailand Chulalongkorn University 45.86
Mexico National Autonomous University of Mexico 45.58
India Indian Institute of Technology Delhi 45.54
Argentina University of Buenos Aires 45.37
Chile Pontifical Catholic University of Chile 45.31
Poland Jagiellonian University 44.94
Hungary Eötvös Loránd University 44.92
Iceland University of Iceland 44.91
Turkey Middle East Technical University 44.87
Malaysia University of Science, Malaysia 44.84
Slovenia University of Ljubljana 44.77
Estonia University of Tartu 44.68
Croatia University of Zagreb 44.62
Saudi Arabia King Saud University 44.59
Colombia University of Los Andes (Colombia) 44.43
Lebanon American University of Beirut 44.38
Slovak Republic Comenius University in Bratislava 44.38
Iran Sharif University of Technology 44.37
Serbia University of Belgrade 44.33
Lithuania Vilnius University 44.25
Egypt Cairo University 44.25
Bulgaria Sofia University 44.19
Uruguay University of the Republic (Uruguay) 44.16
Uganda Makerere University 44.16
Cyprus University of Cyprus 44.1
United Arab Emirates United Arab Emirates University 44.08
Puerto Rico University of Puerto Rico at Mayagüez 44.06
Romania University of Bucharest 44.04

6. Зробіть висновок про те, чи є кореляція у двох останніх величин.

In [351]:
#

In [350]:
#

7. Обчисліть п'ять університетів з найбільшим рейтингом, виведіть їх назви, загальний бал, країни, рейтинги в своїй країні.

In [341]:
df_2015 = df_2015.sort_values(by=['score'], ascending=False)
df_2015_top5 = df_2015.iloc[:5]

for row in df_2015_top5.iterrows():
    name = row[1][1]
    score = row[1][-2]
    country = row[1][2]
    national_rank = row[1][3]
    print(f"Назва: {name}; загальний бал: {score}; країнa: {country}; рейтинг в своїй країні: {national_rank}.")

Назва: Harvard University; загальний бал: 100.0; країнa: USA; рейтинг в своїй країні: 1.
Назва: Stanford University; загальний бал: 98.66; країнa: USA; рейтинг в своїй країні: 2.
Назва: Massachusetts Institute of Technology; загальний бал: 97.54; країнa: USA; рейтинг в своїй країні: 3.
Назва: University of Cambridge; загальний бал: 96.81; країнa: United Kingdom; рейтинг в своїй країні: 1.
Назва: University of Oxford; загальний бал: 96.46; країнa: United Kingdom; рейтинг в своїй країні: 2.

8. Випускники яких 5 університетів володіють найбільшим робочим рейтингом?

In [346]:
df_2015 = df_2015.sort_values(by=['alumni_employment'], ascending=False)
df_2015_top5work = list(df_2015.iloc[:5]['institution'])
df_2015_top5work

['China Pharmaceutical University',
 'Masaryk University',
 'University of Bari Aldo Moro',
 'Liverpool John Moores University',
 'Sharif University of Technology']

9. Як оцінити вплив окремих рейтингів на загальний. Який із зазначених рейтингів дає найбільший внесок у 
загальний рейтинг?

In [349]:
df_2015 = df[df['year'] == 2015]
df_2015.corr()

,world_rank,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
world_rank,1.000000,0.207617,0.577612,0.586218,0.572304,0.907588,0.876108,0.823055,0.947204,0.639701,-0.554571,NaN
national_rank,0.207617,1.000000,0.170368,0.078447,0.171665,0.303851,0.123909,0.158244,0.181568,0.104223,-0.176447,NaN
quality_of_education,0.577612,0.170368,1.000000,0.473653,0.685989,0.521378,0.549574,0.521067,0.517966,0.386652,-0.595771,NaN
alumni_employment,0.586218,0.078447,0.473653,1.000000,0.390605,0.476797,0.418218,0.449119,0.428065,0.398035,-0.480756,NaN
quality_of_faculty,0.572304,0.171665,0.685989,0.390605,1.000000,0.537166,0.570487,0.559989,0.553277,0.418088,-0.708048,NaN
publications,0.907588,0.303851,0.521378,0.476797,0.537166,1.000000,0.845110,0.788885,0.918436,0.616911,-0.521738,NaN
influence,0.876108,0.123909,0.549574,0.418218,0.570487,0.845110,1.000000,0.808917,0.913889,0.548654,-0.522732,NaN
citations,0.823055,0.158244,0.521067,0.449119,0.559989,0.788885,0.808917,1.000000,0.850637,0.518144,-0.517301,NaN
broad_impact,0.947204,0.181568,0.517966,0.428065,0.553277,0.918436,0.913889,0.850637,1.000000,0.580644,-0.527617,NaN
patents,0.639701,0.104223,0.386652,0.398035,0.418088,0.616911,0.548654,0.518144,0.580644,1.000000,-0.454706,NaN
score,-0.554571,-0.176447,-0.595771,-0.480756,-0.708048,-0.521738,-0.522732,-0.517301,-0.527617,-0.454706,1.000000,NaN
year,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN